/**
  ******************************************************************************
  * @file    bsp_usbdisk.c
  * @author  atime
  * @version V1.0
  * @date    2017
  ******************************************************************************
  * @attention
  *
  *
  ******************************************************************************
  */
  
#include "./usb/bsp_usbdisk.h"   




/************************************
函数功能：U盘复位
传递参数：
返回值：
注意：	
***************************************/
signed char usb_disk_reset(void)
{
		return 0;
}






/************************************
函数功能：U盘上电初始化
传递参数：
返回值：
注意：	
***************************************/
signed char usb_disk_init(void)
{
		return 0;
}













/************************************
函数功能：创建文件
传递参数：
返回值：
注意：	
***************************************/
signed char usb_disk_creat_file(unsigned char file_name[5])
{
		return 0;
}






/************************************
函数功能：打开文件
传递参数：
返回值：
注意：	
***************************************/
signed char usb_disk_open_file(unsigned char file_name[5])
{
		return 0;
}






/************************************
函数功能：写入文件
传递参数：
返回值：
注意：	
***************************************/
signed char usb_disk_write_file(unsigned char file_name[5])
{
		return 0;
}









/************************************
函数功能：删除文件
传递参数：
返回值：
注意：	
***************************************/
signed char usb_disk_delete_file(unsigned char file_name[5])
{
		return 0;
}








/************************************
函数功能：
传递参数：
返回值：
注意：	
***************************************/



